Catalogs/Renault_ПредложенияКомплексСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПредложенияКомплексСервисов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КомплексСервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регламентированное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЭксплуатацииЦикл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЭксплуатацииДельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПроведенияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПроведенияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегЦикл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегДельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастМинимальный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастМаксимальный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантийныйАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродленнаяГарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионХолодный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MyRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатКонтроляКачества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПредложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ДополнительныеПредложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ЭтапыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпущенДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпущенПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SARA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ПредложенияКомплексСервисов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Добавить(Команда)
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		ВЫПОЛНИТЬ("ОткрытьФорму(""Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС"",,ЭтаФорма,,,, Новый ОписаниеОповещения(""ДобавитьЗавершение"", Объект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)");
	Иначе
		ОткрытьФорму("Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС",,ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС" Тогда
		
		Объект.КомплексСервис = ВыбранноеЗначение;
		Объект.Наименование = ВыбранноеЗначение;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписание(Команда)
	
	Документ = Элементы.ОписаниеHTML.Документ;
	ТекстДляРедактирования = Документ.body.innerHTML;
	Параметр = Новый Структура("ТекстHTML", ТекстДляРедактирования);
	
	ОтредактТекст = Неопределено;
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		ВЫПОЛНИТЬ("ОткрытьФорму(""Обработка.Renault_РедакторHTML.Форма"",Параметр,ЭтаФорма,,,, Новый ОписаниеОповещения(""РедактироватьОписаниеЗавершение"", Объект, Новый Структура(""Документ"", Документ)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)");
	Иначе
		ОткрытьФорму("Обработка.Renault_РедакторHTML.Форма",Параметр,ЭтаФорма);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	//   РедактироватьОписание(Элемент);
	   
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписаниеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Документ = ДополнительныеПараметры.Документ;
	
	ОтредактТекст = Результат;
	
	Если ОтредактТекст <> Неопределено Тогда
		Документ.body.innerHTML = ОтредактТекст;
		Объект.ОписаниеHTML = ОтредактТекст;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеHTMLДокументСформирован(Элемент)
	
	Документ = Элемент.Документ;
	Документ.Body.innerHTML = Объект.ОписаниеHTML;
	Документ.body.scroll = "no";

КонецПроцедуры

&НаКлиенте
Процедура КомплексСервисНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		ВЫПОЛНИТЬ("ОткрытьФорму(""Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС"",,ЭтаФорма,,,, , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)");
	Иначе
		ОткрытьФорму("Справочник.Renault_ПредложенияКомплексСервисов.Форма.ФормаПодбораКС",,ЭтаФорма);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодПроведенияС) Тогда
		Объект.ПериодПроведенияС = ТекущаяДата();
	КонецЕсли;			
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодПроведенияПо) Тогда
		Объект.ПериодПроведенияПо = ДобавитьМесяц(ТекущаяДата(),12);
	КонецЕсли;			

	Если Модифицированность = Истина Тогда
		Объект.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ПараметрыСеанса.DMS_Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.MyRenault.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
